solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
/*******************************************************************************
 * Variables
 ******************************************************************************/
/* Frequency unit defined in TRANSFER SPEED field in CSD */
static const uint32_t g_transerSpeedFrequencyUnit[] = {100000U, 1000000U, 10000000U, 100000000U};
/* The multiplying value defined in TRANSFER SPEED field in CSD */
static const uint32_t g_transerSpeedMultiplierFactor[] = {0U,  10U, 12U, 13U, 15U, 20U, 26U, 30U,
                                                          35U, 40U, 45U, 52U, 55U, 60U, 70U, 80U};

/*******************************************************************************
 * Code
 ******************************************************************************/
static inline status_t MMC_SelectCard(mmc_card_t *card, bool isSelected)
{
    assert(card != NULL);

    return SDMMC_SelectCard(card->host, card->relativeAddress, isSelected);
}

static inline status_t MMC_SetBlockCount(mmc_card_t *card, uint32_t blockCount)
{
    assert(card != NULL);

    return SDMMC_SetBlockCount(card->host, blockCount);
}

static inline status_t MMC_GoIdle(mmc_card_t *card)
{
    assert(card != NULL);

    return SDMMC_GoIdle(card->host);
}

static inline status_t MMC_SetBlockSize(mmc_card_t *card, uint32_t blockSize)
{
    assert(card != NULL);

    return SDMMC_SetBlockSize(card->host, blockSize);
}

static status_t MMC_ExecuteTuning(mmc_card_t *card)
{
    assert(card != NULL);

    uint32_t blockSize = 0U;

    if (card->busWidth == kMMC_DataBusWidth4bit)
    {
        blockSize = 64U;
    }
    else if (card->busWidth == kMMC_DataBusWidth8bit)
    {
        blockSize = 128U;
    }
    else
    {
        /* do not need tuning in this situation */
        return kStatus_Success;
    }

    return SDMMCHOST_ExecuteTuning(card->host, (uint32_t)kMMC_SendTuningBlock,
                                   (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer),
                                   blockSize);
}

static status_t MMC_Transfer(mmc_card_t *card, sdmmchost_transfer_t *content, uint32_t retry)
{
    assert(content != NULL);
    status_t error;
    uint32_t retuningCount = 3U;

    do
    {
        error = SDMMCHOST_TransferFunction(card->host, content);

        if (error == kStatus_Success)
        {
            break;
        }

        if (((retry == 0U) && (content->data != NULL)) || (error == kStatus_SDMMC_ReTuningRequest))
        {
            /* abort previous transfer firstly */
            (void)MMC_StopTransmission(card);

            if (card->busTiming == kMMC_HighSpeed200Timing)
            {
                if (--retuningCount == 0U)
                {
                    break;
                }
                /* perform retuning */
                if (MMC_ExecuteTuning(card) != kStatus_Success)
                {
                    error = kStatus_SDMMC_TuningFail;
                    SDMMC_LOG("\r\nError: retuning failed.");
                    break;
                }
                else
                {
                    SDMMC_LOG("\r\nlog: retuning successfully.");
                    continue;
                }
            }
        }

        if (retry != 0U)
        {
            retry--;
        }
        else
        {
            break;
        }

    } while (true);

    return error;
}

static status_t MMC_SendStatus(mmc_card_t *card, uint32_t *status)
{
    assert(card != NULL);
    status_t error               = kStatus_Success;
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    uint32_t retry               = 10;

    command.index        = (uint32_t)kSDMMC_SendStatus;
    command.argument     = card->relativeAddress << 16U;
    command.responseType = kCARD_ResponseTypeR1;

    content.command = &command;
    content.data    = NULL;

    while (retry != 0U)
    {
        error = MMC_Transfer(card, &content, 2U);
        if ((--retry == 0U) && (error != kStatus_Success))
        {
            return kStatus_SDMMC_TransferFailed;
        }

        if (kStatus_Success == error)
        {
            break;
        }
    }

    *status = command.response[0U];

    return error;
}

status_t MMC_PollingCardStatusBusy(mmc_card_t *card, bool checkStatus, uint32_t timeoutMs)
{
    assert(card != NULL);

    uint32_t statusTimeoutUs = timeoutMs * 1000U;
    bool cardBusy            = false;
    status_t error           = kStatus_SDMMC_CardStatusBusy;
    uint32_t status          = 0U;

    do
    {
        cardBusy = SDMMCHOST_IsCardBusy(card->host);

        if (cardBusy == false)
        {
            if (checkStatus)
            {
                error = MMC_SendStatus(card, &status);
                if (kStatus_Success == error)
                {
                    /* check the response error */
                    if (0U != (status & (SDMMC_R1_ALL_ERROR_FLAG | SDMMC_MASK(kSDMMC_R1SwitchErrorFlag))))
                    {
                        SDMMC_LOG("\r\nError: CMD13 report switch error %x.", status);

                        error = kStatus_SDMMC_SwitchFailed;
                    }
                    else if ((0U != (status & SDMMC_MASK(kSDMMC_R1ReadyForDataFlag))) &&
                             (SDMMC_R1_CURRENT_STATE(status) != (uint32_t)kSDMMC_R1StateProgram))
                    {
                        error = kStatus_SDMMC_CardStatusIdle;
                        break;
                    }
                    else
                    {
                        SDMMC_LOG("\r\nWarning: CMD13 report busy %x.", status);
                        error = kStatus_SDMMC_CardStatusBusy;
                    }
                }
                else
                {
                    error = kStatus_SDMMC_TransferFailed;
                    break;
                }
            }
            else
            {
                error = kStatus_SDMMC_CardStatusIdle;
                break;
            }
        }

        if (statusTimeoutUs != 0U)
        {
            /* Delay 125us to throttle the polling rate */
            statusTimeoutUs -= SDMMC_OSADelayUs(125U);
        }

    } while (statusTimeoutUs != 0U);

    return error;
}

static status_t MMC_StopTransmission(mmc_card_t *card)
{
    assert(card != NULL);

