solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Success;

    command.index              = (uint32_t)kSDMMC_StopTransmission;
    command.argument           = 0U;
    command.type               = kCARD_CommandTypeAbort;
    command.responseType       = kCARD_ResponseTypeR1b;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    content.command = &command;
    content.data    = NULL;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

static status_t MMC_SendOperationCondition(mmc_card_t *card, uint32_t arg)
{
    assert(card != NULL);

    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};
    status_t error;
    uint32_t i = MMC_CMD1_RETRY_TIMES;

    /* Send CMD1 with the intended voltage range in the argument(either 0x00FF8000 or 0x00000080) */
    command.index        = (uint32_t)kMMC_SendOperationCondition;
    command.argument     = arg;
    command.responseType = kCARD_ResponseTypeR3;

    content.command = &command;
    content.data    = NULL;
    do
    {
        error = SDMMCHOST_TransferFunction(card->host, &content);

        if (error == kStatus_Success)
        {
            /* record OCR register */
            card->ocr = command.response[0U];

            if ((arg == 0U) && (command.response[0U] != 0U))
            {
                error = kStatus_Success;
            }
            /* Repeat CMD1 until the busy bit is cleared. */
            else if (0U == (command.response[0U] & MMC_OCR_BUSY_MASK))
            {
                error = kStatus_Timeout;
            }
            else
            {
                error = kStatus_Success;
                if (((card->ocr & MMC_OCR_ACCESS_MODE_MASK) >> MMC_OCR_ACCESS_MODE_SHIFT) ==
                    (uint32_t)kMMC_AccessModeSector)
                {
                    card->flags |= (uint32_t)kMMC_SupportHighCapacityFlag;
                }
            }
        }

        SDMMC_OSADelay(10U);

    } while ((0U != i--) && (error != kStatus_Success));

    return error;
}

static status_t MMC_SetRelativeAddress(mmc_card_t *card)
{
    assert(card != NULL);

    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};
    status_t error               = kStatus_Success;

    /* Send CMD3 with a chosen relative address, with value greater than 1 */
    command.index        = (uint32_t)kMMC_SetRelativeAddress;
    command.argument     = (MMC_DEFAULT_RELATIVE_ADDRESS << 16U);
    command.responseType = kCARD_ResponseTypeR1;

    content.command = &command;
    content.data    = NULL;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if ((kStatus_Success == error) || (0U == ((command.response[0U]) & SDMMC_R1_ALL_ERROR_FLAG)))
    {
        card->relativeAddress = MMC_DEFAULT_RELATIVE_ADDRESS;
        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static void MMC_DecodeCsd(mmc_card_t *card, uint32_t *rawCsd)
{
    assert(card != NULL);
    assert(rawCsd != NULL);

    mmc_csd_t *csd;
    uint32_t multiplier;

    csd                             = &(card->csd);
    csd->csdStructureVersion        = (uint8_t)((rawCsd[3U] & 0xC0000000U) >> 30U);
    csd->systemSpecificationVersion = (uint8_t)((rawCsd[3U] & 0x3C000000U) >> 26U);
    csd->dataReadAccessTime1        = (uint8_t)((rawCsd[3U] & 0xFF0000U) >> 16U);
    csd->dataReadAccessTime2        = (uint8_t)((rawCsd[3U] & 0xFF00U) >> 8U);
    csd->transferSpeed              = (uint8_t)(rawCsd[3U] & 0xFFU);
    csd->cardCommandClass           = (uint16_t)((rawCsd[2U] & 0xFFF00000U) >> 20U);
    /* Max block length read/write one time */
    csd->readBlockLength = (uint8_t)((rawCsd[2U] & 0xF0000U) >> 16U);
    if ((rawCsd[2U] & 0x8000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdReadBlockPartialFlag;
    }
    if ((rawCsd[2U] & 0x4000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdWriteBlockMisalignFlag;
    }
    if ((rawCsd[2U] & 0x2000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdReadBlockMisalignFlag;
    }
    if ((rawCsd[2U] & 0x1000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdDsrImplementedFlag;
    }
    csd->deviceSize               = (uint16_t)(((rawCsd[2U] & 0x3FFU) << 2U) + ((rawCsd[1U] & 0xC0000000U) >> 30U));
    csd->readCurrentVddMin        = (uint8_t)((rawCsd[1U] & 0x38000000U) >> 27U);
    csd->readCurrentVddMax        = (uint8_t)((rawCsd[1U] & 0x07000000U) >> 24U);
    csd->writeCurrentVddMin       = (uint8_t)((rawCsd[1U] & 0x00E00000U) >> 21U);
    csd->writeCurrentVddMax       = (uint8_t)((rawCsd[1U] & 0x001C0000U) >> 18U);
    csd->deviceSizeMultiplier     = (uint8_t)((rawCsd[1U] & 0x00038000U) >> 15U);
    csd->eraseGroupSize           = (uint8_t)((rawCsd[1U] & 0x00007C00U) >> 10U);
    csd->eraseGroupSizeMultiplier = (uint8_t)((rawCsd[1U] & 0x000003E0U) >> 5U);
    csd->writeProtectGroupSize    = (uint8_t)(rawCsd[1U] & 0x0000001FU);
    if ((rawCsd[0U] & 0x80000000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdWriteProtectGroupEnabledFlag;
    }
    csd->defaultEcc          = (uint8_t)((rawCsd[0U] & 0x60000000U) >> 29U);
    csd->writeSpeedFactor    = (uint8_t)((rawCsd[0U] & 0x1C000000U) >> 26U);
    csd->maxWriteBlockLength = (uint8_t)((rawCsd[0U] & 0x03C00000U) >> 22U);
    if ((rawCsd[0U] & 0x00200000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdWriteBlockPartialFlag;
    }
    if ((rawCsd[0U] & 0x00010000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_ContentProtectApplicationFlag;
    }
    if ((rawCsd[0U] & 0x00008000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdFileFormatGroupFlag;
    }
    if ((rawCsd[0U] & 0x00004000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdCopyFlag;
    }
    if ((rawCsd[0U] & 0x00002000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdPermanentWriteProtectFlag;
    }
    if ((rawCsd[0U] & 0x00001000U) != 0U)
    {
        csd->flags |= (uint16_t)kMMC_CsdTemporaryWriteProtectFlag;
    }
    csd->fileFormat = (uint8_t)((rawCsd[0U] & 0x00000C00U) >> 10U);
    csd->eccCode    = (uint8_t)((rawCsd[0U] & 0x00000300U) >> 8U);

    /* Calculate the device total block count. */
    /* For the card capacity of witch higher than 2GB, the maximum possible value should be set to this register
    is 0xFFF. */
    if (card->csd.deviceSize != 0xFFFU)
    {
        multiplier                = (2UL << (card->csd.deviceSizeMultiplier + 2U - 1U));
        card->userPartitionBlocks = (((card->csd.deviceSize + 1UL) * multiplier) / FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    }

    card->blockSize = FSL_SDMMC_DEFAULT_BLOCK_SIZE;
}

