solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
static void MMC_SetMaxFrequency(mmc_card_t *card)
{
    assert(card != NULL);

    uint32_t frequencyUnit;
    uint32_t multiplierFactor;
    uint32_t maxBusClock_Hz;

    /* g_fsdhcCommandUnitInTranSpeed and g_transerSpeedMultiplierFactor are used to calculate the max speed in normal
    mode not high speed mode.
    For cards supporting version 4.0, 4.1, and 4.2 of the specification, the value shall be 20MHz(0x2A).
    For cards supporting version 4.3, the value shall be 26 MHz (0x32H). In High speed mode, the max
    frequency is decided by CARD_TYPE in Extended CSD. */
    frequencyUnit     = g_transerSpeedFrequencyUnit[READ_MMC_TRANSFER_SPEED_FREQUENCY_UNIT(card->csd)];
    multiplierFactor  = g_transerSpeedMultiplierFactor[READ_MMC_TRANSFER_SPEED_MULTIPLIER(card->csd)];
    maxBusClock_Hz    = (frequencyUnit * multiplierFactor) / DIVIDER_IN_TRANSFER_SPEED;
    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, maxBusClock_Hz);
}

static status_t MMC_SetMaxEraseUnitSize(mmc_card_t *card)
{
    assert(card != NULL);

    uint32_t erase_group_size;
    uint32_t erase_group_multiplier;
    mmc_extended_csd_config_t extendedCsdconfig;

    /* Legacy mmc card , do not support the command */
    if ((card->csd.systemSpecificationVersion == (uint32_t)kMMC_SpecificationVersion3) &&
        (card->csd.csdStructureVersion == (uint32_t)kMMC_CsdStrucureVersion12))
    {
        return kStatus_Success;
    }

    if (((0U == (card->flags & (uint32_t)kMMC_SupportHighCapacityFlag)) ||
         (card->extendedCsd.highCapacityEraseUnitSize == 0U)) ||
        (card->extendedCsd.highCapacityEraseTimeout == 0U))
    {
        erase_group_size       = card->csd.eraseGroupSize;
        erase_group_multiplier = card->csd.eraseGroupSizeMultiplier;
        card->eraseGroupBlocks = ((erase_group_size + 1U) * (erase_group_multiplier + 1U));
    }
    else
    {
        /* Erase Unit Size = 512Kbyte * HC_ERASE_GRP_SIZE. Block size is 512 bytes. */
        card->eraseGroupBlocks = (card->extendedCsd.highCapacityEraseUnitSize * 1024UL);
        /* Enable high capacity erase unit size. */
        extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeSetBits;
        extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexEraseGroupDefinition;
        extendedCsdconfig.ByteValue  = 0x01U; /* The high capacity erase unit size enable bit is bit 0 */
        extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
        if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
        {
            return kStatus_SDMMC_ConfigureExtendedCsdFailed;
        }
    }

    return kStatus_Success;
}

static status_t MMC_SetExtendedCsdConfig(mmc_card_t *card, const mmc_extended_csd_config_t *config, uint32_t timeout)
{
    assert(card != NULL);
    assert(config != NULL);

    status_t error               = kStatus_Success;
    uint32_t parameter           = 0U;
    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};
    uint32_t timeoutMS           = timeout == 0U ? card->extendedCsd.genericCMD6Timeout : timeout;

    parameter |= ((uint32_t)(config->commandSet) << MMC_SWITCH_COMMAND_SET_SHIFT);
    parameter |= ((uint32_t)(config->ByteValue) << MMC_SWITCH_VALUE_SHIFT);
    parameter |= ((uint32_t)(config->ByteIndex) << MMC_SWITCH_BYTE_INDEX_SHIFT);
    parameter |= ((uint32_t)(config->accessMode) << MMC_SWITCH_ACCESS_MODE_SHIFT);
    command.index        = (uint32_t)kMMC_Switch;
    command.argument     = parameter;
    command.responseType = kCARD_ResponseTypeR1b; /* Send switch command to set the pointed byte in Extended CSD. */
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG | SDMMC_MASK(kSDMMC_R1SwitchErrorFlag);

    content.command = &command;
    content.data    = NULL;
    error           = MMC_Transfer(card, &content, 2U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    /* Wait for the card write process complete because of that card read process and write process use one buffer. */
    error = MMC_PollingCardStatusBusy(card, true, timeoutMS == 0U ? MMC_CARD_ACCESS_WAIT_IDLE_TIMEOUT : timeoutMS);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    return kStatus_Success;
}

static void MMC_DecodeExtendedCsd(mmc_card_t *card, uint32_t *rawExtendedCsd)
{
    assert(card != NULL);
    assert(rawExtendedCsd != NULL);

    uint8_t *buffer                 = (uint8_t *)rawExtendedCsd;
    mmc_extended_csd_t *extendedCsd = &(card->extendedCsd);

    /* Extended CSD is transferred as a data block from least byte indexed 0. */
    extendedCsd->bootPartitionWP                 = buffer[173U];
    extendedCsd->bootWPStatus                    = buffer[174U];
    extendedCsd->highDensityEraseGroupDefinition = buffer[175U];
    extendedCsd->bootDataBusConditions           = buffer[177U];
    extendedCsd->bootConfigProtect               = buffer[178U];
    extendedCsd->partitionConfig                 = buffer[179U];
    extendedCsd->eraseMemoryContent              = buffer[181U];
    extendedCsd->dataBusWidth                    = buffer[183U];
    extendedCsd->highSpeedTiming                 = buffer[185U];
    extendedCsd->powerClass                      = buffer[187U];
    extendedCsd->commandSetRevision              = buffer[189U];
    extendedCsd->commandSet                      = buffer[191U];
    extendedCsd->extendecCsdVersion              = buffer[192U];
    extendedCsd->csdStructureVersion             = buffer[194U];
    extendedCsd->partitionAttribute              = buffer[156U];
    extendedCsd->extPartitionSupport             = buffer[494U];
    extendedCsd->cardType                        = buffer[196U];
    /* This field define the type of the card. The only currently valid values for this field are 0x01 and 0x03. */
    card->flags |= extendedCsd->cardType;

