solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
    extendedCsd->ioDriverStrength = buffer[197U];

    extendedCsd->partitionSwitchTimeout                    = buffer[199U];
    extendedCsd->powerClass52MHz195V                       = buffer[200U];
    extendedCsd->powerClass26MHz195V                       = buffer[201U];
    extendedCsd->powerClass52MHz360V                       = buffer[202U];
    extendedCsd->powerClass26MHz360V                       = buffer[203U];
    extendedCsd->powerClass200MHZVCCQ130VVCC360V           = buffer[236U];
    extendedCsd->powerClass200MHZVCCQ195VVCC360V           = buffer[237U];
    extendedCsd->powerClass52MHZDDR195V                    = buffer[238U];
    extendedCsd->powerClass52MHZDDR360V                    = buffer[239U];
    extendedCsd->powerClass200MHZDDR360V                   = buffer[253U];
    extendedCsd->minimumReadPerformance4Bit26MHz           = buffer[205U];
    extendedCsd->minimumWritePerformance4Bit26MHz          = buffer[206U];
    extendedCsd->minimumReadPerformance8Bit26MHz4Bit52MHz  = buffer[207U];
    extendedCsd->minimumWritePerformance8Bit26MHz4Bit52MHz = buffer[208U];
    extendedCsd->minimumReadPerformance8Bit52MHz           = buffer[209U];
    extendedCsd->minimumWritePerformance8Bit52MHz          = buffer[210U];
    extendedCsd->minReadPerformance8bitAt52MHZDDR          = buffer[234U];
    extendedCsd->minWritePerformance8bitAt52MHZDDR         = buffer[235U];
    /* Get user partition size. */
    extendedCsd->sectorCount = ((((uint32_t)buffer[215U]) << 24U) + (((uint32_t)buffer[214U]) << 16U) +
                                (((uint32_t)buffer[213U]) << 8U) + (uint32_t)buffer[212U]);
    if ((card->flags & (uint32_t)kMMC_SupportHighCapacityFlag) != 0U)
    {
        card->userPartitionBlocks = card->extendedCsd.sectorCount;
    }

    extendedCsd->sleepAwakeTimeout                 = buffer[217U];
    extendedCsd->sleepCurrentVCCQ                  = buffer[219U];
    extendedCsd->sleepCurrentVCC                   = buffer[220U];
    extendedCsd->highCapacityWriteProtectGroupSize = buffer[221U];
    extendedCsd->reliableWriteSectorCount          = buffer[222U];
    extendedCsd->highCapacityEraseTimeout          = buffer[223U];
    extendedCsd->highCapacityEraseUnitSize         = buffer[224U];
    extendedCsd->accessSize                        = buffer[225U];

    /* Get boot partition size: 128KB * BOOT_SIZE_MULT*/
    card->bootPartitionBlocks = ((128U * 1024U * buffer[226U]) / FSL_SDMMC_DEFAULT_BLOCK_SIZE);

    /* support HS400 data strobe */
    if (buffer[184] == 1U)
    {
        card->flags |= (uint32_t)kMMC_SupportEnhanceHS400StrobeFlag;
    }

    /* Check if card support boot mode. */
    if ((buffer[228U] & 0x1U) != 0U)
    {
        card->flags |= (uint32_t)kMMC_SupportAlternateBootFlag;
    }
    else if ((buffer[228U] & 0x2U) != 0U)
    {
        card->flags |= (uint32_t)kMMC_SupportDDRBootFlag;
    }
    else if ((buffer[228U] & 0x4U) != 0U)
    {
        card->flags |= (uint32_t)kMMC_SupportHighSpeedBootFlag;
    }
    else
    {
        /* empty with intentional */
    }
    /* cache size unit 1kb */
    extendedCsd->cacheSize = (((uint32_t)buffer[252U]) << 24) | (((uint32_t)buffer[251U]) << 16) |
                             (((uint32_t)buffer[250U]) << 8) | (((uint32_t)buffer[249U]));

    extendedCsd->genericCMD6Timeout  = buffer[248U] * 10UL;
    extendedCsd->supportedCommandSet = buffer[504U];
}

static status_t MMC_SendExtendedCsd(mmc_card_t *card, uint8_t *targetAddr, uint32_t byteIndex)
{
    assert(card != NULL);

    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};
    sdmmchost_data_t data        = {0};
    uint32_t *alignBuffer        = (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error               = kStatus_Success;

    /* Legacy mmc card , do not support the command */
    if ((card->csd.systemSpecificationVersion == (uint32_t)kMMC_SpecificationVersion3) &&
        (card->csd.csdStructureVersion == (uint32_t)kMMC_CsdStrucureVersion12))
    {
        return kStatus_Success;
    }

    (void)memset(alignBuffer, 0, MMC_EXTENDED_CSD_BYTES);

    command.index        = (uint32_t)kMMC_SendExtendedCsd;
    command.argument     = 0U;
    command.responseType = kCARD_ResponseTypeR1;

    data.blockCount = 1U;
    data.blockSize  = MMC_EXTENDED_CSD_BYTES;
    data.rxData     = alignBuffer;

    content.command = &command;
    content.data    = &data;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if ((kStatus_Success == error) && (0U == (command.response[0U] & SDMMC_R1_ALL_ERROR_FLAG)))
    {
        SDMMCHOST_ConvertDataToLittleEndian(card->host, alignBuffer, MMC_EXTENDED_CSD_BYTES / 4U,
                                            kSDMMC_DataPacketFormatLSBFirst);
        if (targetAddr != NULL)
        {
            *targetAddr = ((uint8_t *)alignBuffer)[byteIndex];
        }
        else
        {
            MMC_DecodeExtendedCsd(card, alignBuffer);
        }

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_SetPowerClass(mmc_card_t *card)
{
    assert(card != NULL);

    uint8_t mask = 0, shift = 0U;
    uint8_t powerClass = 0;
    mmc_extended_csd_config_t extendedCsdconfig;

    /* Legacy mmc card , do not support the command */
    if ((card->csd.systemSpecificationVersion == (uint32_t)kMMC_SpecificationVersion3) &&
        (card->csd.csdStructureVersion == (uint32_t)kMMC_CsdStrucureVersion12))
    {
        return kStatus_Success;
    }

    if ((card->busWidth == kMMC_DataBusWidth4bit) || (card->busWidth == kMMC_DataBusWidth4bitDDR))
    {
        mask  = MMC_POWER_CLASS_4BIT_MASK; /* The mask of 4 bit bus width's power class */
        shift = 0U;
    }
    else if ((card->busWidth == kMMC_DataBusWidth8bit) || (card->busWidth == kMMC_DataBusWidth8bitDDR))
    {
        mask  = MMC_POWER_CLASS_8BIT_MASK; /* The mask of 8 bit bus width's power class */
        shift = 4U;
    }
    else
    {
        return kStatus_Success;
    }

    switch (card->hostVoltageWindowVCC)
    {
        case kMMC_VoltageWindows270to360:

            if (card->busTiming == kMMC_HighSpeed200Timing)
            {
                if (card->hostVoltageWindowVCCQ == kMMC_VoltageWindow170to195)
                {
                    powerClass = ((card->extendedCsd.powerClass200MHZVCCQ195VVCC360V) & mask);
                }
                else if (card->hostVoltageWindowVCCQ == kMMC_VoltageWindow120)
                {
                    powerClass = ((card->extendedCsd.powerClass200MHZVCCQ130VVCC360V) & mask);
                }
                else
                {
                    /* intentional empty */
                }
            }
            else if (card->busTiming == kMMC_HighSpeed400Timing)
            {
                powerClass = ((card->extendedCsd.powerClass200MHZDDR360V) & mask);
            }
            else if ((card->busTiming == kMMC_HighSpeedTiming) && (card->busWidth > kMMC_DataBusWidth8bit))
            {
                powerClass = ((card->extendedCsd.powerClass52MHZDDR360V) & mask);
            }
            else if ((card->busTiming == kMMC_HighSpeedTiming) && (card->busClock_Hz > MMC_CLOCK_26MHZ))
            {
                powerClass = ((card->extendedCsd.powerClass52MHz360V) & mask);
            }
            else if (card->busTiming == kMMC_HighSpeedTiming)
            {
                powerClass = ((card->extendedCsd.powerClass26MHz360V) & mask);
            }
            else
            {
                /* intentional empty */
            }

            break;

