solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
        case kMMC_VoltageWindow170to195:

            if ((card->busTiming == kMMC_HighSpeedTiming) && (card->busClock_Hz <= MMC_CLOCK_26MHZ))
            {
                powerClass = ((card->extendedCsd.powerClass26MHz195V) & mask);
            }
            else if ((card->busTiming == kMMC_HighSpeedTiming) && (card->busClock_Hz > MMC_CLOCK_26MHZ))
            {
                powerClass = ((card->extendedCsd.powerClass52MHz195V) & mask);
            }
            else if ((card->busTiming == kMMC_HighSpeedTiming) && (card->busWidth > kMMC_DataBusWidth8bit))
            {
                powerClass = ((card->extendedCsd.powerClass52MHZDDR195V) & mask);
            }
            else
            {
                /* intentional empty */
            }

            break;
        default:
            powerClass = 0;
            break;
    }

    /* due to 8bit power class position [7:4] */
    powerClass >>= shift;

    if (powerClass > 0U)
    {
        extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
        extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexPowerClass;
        extendedCsdconfig.ByteValue  = powerClass;
        extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
        if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
        {
            return kStatus_SDMMC_ConfigureExtendedCsdFailed;
        }
        /* restore power class */
        card->extendedCsd.powerClass = powerClass;
    }

    return kStatus_Success;
}

static status_t MMC_SendTestPattern(mmc_card_t *card, uint32_t blockSize, uint32_t *pattern)
{
    assert(card != NULL);
    assert(blockSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    assert(pattern != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kMMC_SendingBusTest;
    command.argument     = 0U;
    command.responseType = kCARD_ResponseTypeR1;

    /* Ignore errors in bus test procedure to improve chances that the test will work. */
    data.enableIgnoreError = true;
    data.blockCount        = 1U;
    data.blockSize         = blockSize;
    data.txData            = pattern;

    content.command = &command;
    content.data    = &data;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if ((kStatus_Success != error) || ((command.response[0U] & SDMMC_R1_ALL_ERROR_FLAG) != 0U))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

static status_t MMC_ReceiveTestPattern(mmc_card_t *card, uint32_t blockSize, uint32_t *pattern)
{
    assert(card != NULL);
    assert(blockSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    assert(pattern != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    sdmmchost_data_t data        = {0};
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kMMC_BusTestRead;
    command.responseType = kCARD_ResponseTypeR1;

    /* Ignore errors in bus test procedure to improve chances that the test will work. */
    data.enableIgnoreError = true;
    data.blockCount        = 1U;
    data.blockSize         = blockSize;
    data.rxData            = pattern;

    content.command = &command;
    content.data    = &data;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if ((kStatus_Success != error) || (((command.response[0U]) & SDMMC_R1_ALL_ERROR_FLAG) != 0U))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

static status_t MMC_TestDataBusWidth(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card != NULL);

    uint32_t blockSize       = 0U;
    uint32_t tempsendPattern = 0U;
    uint32_t *tempPattern    = (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    uint32_t xorMask         = 0U;
    uint32_t xorResult       = 0U;

    /* For 8 data lines the data block would be (MSB to LSB): 0x0000_0000_0000_AA55,
    For 4 data lines the data block would be (MSB to LSB): 0x0000_005A,
    For only 1 data line the data block would be: 0x80 */
    switch (width)
    {
        case kMMC_DataBusWidth8bit:
        case kMMC_DataBusWidth8bitDDR:
            blockSize       = 8U;
            tempPattern[0U] = 0xAA55U;
            xorMask         = 0xFFFFU;
            xorResult       = 0xFFFFU;
            break;
        case kMMC_DataBusWidth4bit:
        case kMMC_DataBusWidth4bitDDR:
            blockSize       = 4U;
            tempPattern[0U] = 0x5AU;
            xorMask         = 0xFFU;
            xorResult       = 0xFFU;
            break;
        default:
            blockSize       = 4U;
            tempPattern[0U] = 0x80U;
            xorMask         = 0xFFU;
            xorResult       = 0xC0U;
            break;
    }

    SDMMCHOST_ConvertDataToLittleEndian(card->host, &tempPattern[0], 1U, kSDMMC_DataPacketFormatLSBFirst);
    SDMMCHOST_ConvertDataToLittleEndian(card->host, &xorMask, 1U, kSDMMC_DataPacketFormatLSBFirst);
    SDMMCHOST_ConvertDataToLittleEndian(card->host, &xorResult, 1U, kSDMMC_DataPacketFormatLSBFirst);

    (void)MMC_SendTestPattern(card, blockSize, tempPattern);
    /* restore the send pattern */
    tempsendPattern = tempPattern[0U];
    /* reset the global buffer */
    tempPattern[0U] = 0U;

    (void)MMC_ReceiveTestPattern(card, blockSize, tempPattern);

    /* XOR the send pattern and receive pattern */
    if (((tempPattern[0U] ^ tempsendPattern) & xorMask) != xorResult)
    {
        return kStatus_Fail;
    }

    return kStatus_Success;
}

static status_t MMC_SetDataBusWidth(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card != NULL);

    mmc_extended_csd_config_t extendedCsdconfig;

    /* Set data bus width */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexBusWidth;
    extendedCsdconfig.ByteValue  = (uint8_t)width;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }
    /* restore data bus width */
    card->extendedCsd.dataBusWidth = (uint8_t)width;

    return kStatus_Success;
}

static status_t MMC_SetMaxDataBusWidth(mmc_card_t *card, mmc_high_speed_timing_t targetTiming)
{
    assert(card != NULL);

    status_t error = kStatus_Fail;

    do
    {
        if (card->busWidth == kMMC_DataBusWidth1bit)
        {
            card->busWidth = kMMC_DataBusWidth8bitDDR;
        }

        if (card->busWidth == kMMC_DataBusWidth8bitDDR)
        {
            if (((card->host->capability &
                  ((uint32_t)kSDMMCHOST_Support8BitDataWidth | (uint32_t)kSDMMCHOST_SupportDDRMode)) ==
                 ((uint32_t)kSDMMCHOST_Support8BitDataWidth | (uint32_t)kSDMMCHOST_SupportDDRMode)) &&
                (0U != (card->flags & ((uint32_t)kMMC_SupportHighSpeedDDR52MHZ180V300VFlag |
                                       (uint32_t)kMMC_SupportHighSpeedDDR52MHZ120VFlag))) &&
                ((targetTiming == kMMC_HighSpeedTiming) || (targetTiming == kMMC_HighSpeed400Timing)) &&
                ((card->usrParam.capability & (uint32_t)kSDMMC_Support8BitWidth) != 0U))
            {
                SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith8Bit);
                if (kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth8bitDDR))
                {
                    if (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth8bitDDR))
                    {
                        error          = kStatus_Success;
                        card->busWidth = kMMC_DataBusWidth8bitDDR;
                        break;
                    }
                }

                /* HS400 mode only support 8bit data bus */
                if (card->busTiming == kMMC_HighSpeed400Timing)
                {
                    return kStatus_SDMMC_SetDataBusWidthFailed;
                }
            }
            card->busWidth = kMMC_DataBusWidth4bitDDR;
        }

        if (card->busWidth == kMMC_DataBusWidth4bitDDR)
        {
            if (((card->host->capability &
                  ((uint32_t)kSDMMCHOST_Support4BitDataWidth | (uint32_t)kSDMMCHOST_SupportDDRMode)) ==
                 ((uint32_t)kSDMMCHOST_Support4BitDataWidth | (uint32_t)kSDMMCHOST_SupportDDRMode)) &&
                (0U != (card->flags & ((uint32_t)kMMC_SupportHighSpeedDDR52MHZ180V300VFlag |
                                       (uint32_t)kMMC_SupportHighSpeedDDR52MHZ120VFlag))) &&
                ((targetTiming == kMMC_HighSpeedTiming) || (targetTiming == kMMC_HighSpeed400Timing)))
            {
                SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith4Bit);
                if (kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth4bitDDR))
                {
                    if (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth4bitDDR))
                    {
                        error          = kStatus_Success;
                        card->busWidth = kMMC_DataBusWidth4bitDDR;
                        break;
                    }
                }
            }
            card->busWidth = kMMC_DataBusWidth8bit;
        }

        if (card->busWidth == kMMC_DataBusWidth8bit)
        {
            if (((card->host->capability & (uint32_t)kSDMMCHOST_Support8BitDataWidth) != 0U) &&
                ((targetTiming == kMMC_HighSpeedTiming) || (targetTiming == kMMC_HighSpeed200Timing)) &&
                ((card->usrParam.capability & (uint32_t)kSDMMC_Support8BitWidth) != 0U))
            {
                SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith8Bit);
                if (kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth8bit))
                {
                    if (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth8bit))
                    {
                        error          = kStatus_Success;
                        card->busWidth = kMMC_DataBusWidth8bit;
                        break;
                    }
                }
            }
            card->busWidth = kMMC_DataBusWidth4bit;
        }

        if (card->busWidth == kMMC_DataBusWidth4bit)
        {
            if (((card->host->capability & (uint32_t)kSDMMCHOST_Support8BitDataWidth) != 0U) &&
                ((targetTiming == kMMC_HighSpeedTiming) || (targetTiming == kMMC_HighSpeed200Timing)))
            {
                SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith4Bit);
                if (kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth4bit))
                {
                    if (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth4bit))
                    {
                        error          = kStatus_Success;
                        card->busWidth = kMMC_DataBusWidth4bit;
                        break;
                    }
                }
                /* HS200 mode only support 4bit/8bit data bus */
                if (targetTiming == kMMC_HighSpeed200Timing)
                {
                    return kStatus_SDMMC_SetDataBusWidthFailed;
                }
            }
        }

    } while (false);

