solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
    if (error == kStatus_Fail)
    {
        /* Card's data bus width will be default 1 bit mode. */
        SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith1Bit);
        card->busWidth = kMMC_DataBusWidth1bit;
    }

    return kStatus_Success;
}

static status_t MMC_SwitchHSTiming(mmc_card_t *card, uint8_t timing, uint8_t driverStrength)
{
    assert(card != NULL);

    uint8_t hsTiming = 0;

    mmc_extended_csd_config_t extendedCsdconfig;

    /* check the target driver strength support or not */
    if (((card->extendedCsd.ioDriverStrength & (1U << driverStrength)) == 0U) &&
        (card->extendedCsd.extendecCsdVersion >= (uint8_t)kMMC_ExtendedCsdRevision17))
    {
        return kStatus_SDMMC_NotSupportYet;
    }
    /* calucate the register value */
    hsTiming = (timing & 0xFU) | (uint8_t)(driverStrength << 4U);

    /* Switch to high speed timing. */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexHighSpeedTiming;
    extendedCsdconfig.ByteValue  = hsTiming;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    card->extendedCsd.highSpeedTiming = hsTiming;

    return kStatus_Success;
}

static status_t MMC_SwitchToHighSpeed(mmc_card_t *card)
{
    assert(card != NULL);

    uint32_t freq = 0U;

    if (kStatus_Success != MMC_SwitchHSTiming(card, (uint8_t)kMMC_HighSpeedTiming, kMMC_DriverStrength0))
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    if ((card->flags & (uint32_t)kMMC_SupportHighSpeed52MHZFlag) != 0U)
    {
        freq = FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, MMC_CLOCK_52MHZ);
    }
    else if ((card->flags & (uint32_t)kMMC_SupportHighSpeed26MHZFlag) != 0U)
    {
        freq = FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, MMC_CLOCK_26MHZ);
    }
    else
    {
        /* Intentional empty */
    }

    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, freq);
    /* config io speed and strength */
    if (card->usrParam.ioStrength != NULL)
    {
        card->usrParam.ioStrength(MMC_CLOCK_52MHZ);
    }
    /* Set card data width, it is nessesary to config the the data bus here, to meet emmc5.0 specification,
     * when you are working in DDR mode , HS_TIMING must set before set bus width
     */
    if (MMC_SetMaxDataBusWidth(card, kMMC_HighSpeedTiming) != kStatus_Success)
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }

    if ((card->busWidth == kMMC_DataBusWidth4bitDDR) || (card->busWidth == kMMC_DataBusWidth8bitDDR))
    {
        SDMMCHOST_EnableDDRMode(card->host, true, 0U);
    }

    card->busTiming = kMMC_HighSpeedTiming;

    return kStatus_Success;
}

static status_t MMC_SwitchToHS200(mmc_card_t *card, uint32_t freq)
{
    assert(card != NULL);

    status_t error = kStatus_Fail;

    if ((card->hostVoltageWindowVCCQ != kMMC_VoltageWindow170to195) &&
        (card->hostVoltageWindowVCCQ != kMMC_VoltageWindow120))
    {
        return kStatus_SDMMC_InvalidVoltage;
    }

    /* select bus width before select bus timing for HS200 mode */
    if (MMC_SetMaxDataBusWidth(card, kMMC_HighSpeed200Timing) != kStatus_Success)
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }

    /* switch to HS200 mode */
    if (kStatus_Success != MMC_SwitchHSTiming(card, (uint8_t)kMMC_HighSpeed200Timing, kMMC_DriverStrength0))
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, freq);
    /* config io speed and strength */
    if (card->usrParam.ioStrength != NULL)
    {
        card->usrParam.ioStrength(freq);
    }

    /* excute tuning for HS200 */
    if (MMC_ExecuteTuning(card) != kStatus_Success)
    {
        return kStatus_SDMMC_TuningFail;
    }

    card->busTiming = kMMC_HighSpeed200Timing;

    error = MMC_PollingCardStatusBusy(card, true, MMC_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    return kStatus_Success;
}

static status_t MMC_SwitchToHS400(mmc_card_t *card)
{
    assert(card != NULL);

    uint32_t status    = 0U;
    uint32_t hs400Freq = FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, MMC_CLOCK_HS400);
    status_t error     = kStatus_Fail;

    if ((card->hostVoltageWindowVCCQ != kMMC_VoltageWindow170to195) &&
        (card->hostVoltageWindowVCCQ != kMMC_VoltageWindow120))
    {
        return kStatus_SDMMC_InvalidVoltage;
    }

    if (card->host->hostController.sourceClock_Hz < MMC_CLOCK_HS400)
    {
        hs400Freq = card->host->hostController.sourceClock_Hz;
    }

    if ((card->host->hostController.sourceClock_Hz > MMC_CLOCK_HS400) &&
        (card->host->hostController.sourceClock_Hz % MMC_CLOCK_HS400 != 0U))
    {
        hs400Freq = card->host->hostController.sourceClock_Hz /
                    (card->host->hostController.sourceClock_Hz / MMC_CLOCK_HS400 + 1U);
    }
    /* HS400 mode support 8 bit data bus only */
    card->busWidth = kMMC_DataBusWidth8bit;
    /* switch to HS200 perform tuning */
    if (kStatus_Success != MMC_SwitchToHS200(card, hs400Freq / 2U))
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    /* check data bus width is 8 bit , otherwise return false*/
    if (card->busWidth != kMMC_DataBusWidth8bit)
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    /*
     * For the issue found in stress test of repeat emmc initialization operation, after HS200 switch complete, the emmc
     * status not correct for switching to high speed, normally the emmc should stay in TRAN state, but sometimes the
     * emmc status is in DATA state which will cause switch to High speed failed. when such issue happen, software will
     * try to use CMD12 to reset the emmc status to TRAN before switch to high speed for HS400.
     */
    error = MMC_SendStatus(card, &status);
    if (error != kStatus_Success)
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    if (SDMMC_R1_CURRENT_STATE(status) == (uint32_t)kSDMMC_R1StateSendData)
    {
        SDMMC_LOG("status uncorrect for switching to High speed timing, try use CMD12 to get back to TRAN state\r\n");
        /* try to get back to transfer state before switch to High speed */
        (void)MMC_StopTransmission(card);
    }

    /*switch to high speed*/
    if (kStatus_Success != MMC_SwitchHSTiming(card, (uint8_t)kMMC_HighSpeedTiming, kMMC_DriverStrength0))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    /* switch to high speed first */
    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, MMC_CLOCK_52MHZ);
    /* config io strength */
    if (card->usrParam.ioStrength != NULL)
    {
        card->usrParam.ioStrength(MMC_CLOCK_52MHZ);
    }

