solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
    card->busTiming = kMMC_HighSpeed400Timing;
    /* switch to 8 bit DDR data bus width */
    if (kStatus_Success != MMC_SetDataBusWidth(card, kMMC_DataBusWidth8bitDDR))
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }
    /* switch to HS400 */
    if (kStatus_Success != MMC_SwitchHSTiming(card, (uint8_t)kMMC_HighSpeed400Timing, kMMC_DriverStrength0))
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }
    /* config to target freq */
    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, hs400Freq / 2U);
    /* config io speed and strength */
    if (card->usrParam.ioStrength != NULL)
    {
        card->usrParam.ioStrength(MMC_CLOCK_HS200);
    }
    /* enable HS400 mode */
    SDMMCHOST_EnableHS400Mode(card->host, true);
    /* enable DDR mode */
    SDMMCHOST_EnableDDRMode(card->host, true, 0U);
    /* config strobe DLL*/
    SDMMCHOST_EnableStrobeDll(card->host, true);

    return kStatus_Success;
}

static status_t MMC_SelectBusTiming(mmc_card_t *card)
{
    assert(card != NULL);

    /* Legacy mmc card , do not support the command */
    if ((card->csd.systemSpecificationVersion == (uint8_t)kMMC_SpecificationVersion3) &&
        (card->csd.csdStructureVersion == (uint8_t)kMMC_CsdStrucureVersion12))
    {
        return kStatus_Success;
    }

    do
    {
        if (card->busTiming == kMMC_HighSpeedTimingNone)
        {
            /* if timing not specified, probe card capability from HS400 mode */
            card->busTiming = kMMC_HighSpeed400Timing;
        }

        if (card->busTiming == kMMC_EnhanceHighSpeed400Timing)
        {
            return kStatus_SDMMC_NotSupportYet;
        }

        if (card->busTiming == kMMC_HighSpeed400Timing)
        {
            if (((card->host->capability & (uint32_t)kSDMMCHOST_SupportHS400) != 0U) &&
                ((card->hostVoltageWindowVCCQ == kMMC_VoltageWindow170to195) ||
                 (card->hostVoltageWindowVCCQ == kMMC_VoltageWindow120)) &&
                ((card->flags &
                  ((uint32_t)kMMC_SupportHS400DDR200MHZ180VFlag | (uint32_t)kMMC_SupportHS400DDR200MHZ120VFlag)) != 0U))
            {
                /* switch to HS400 */
                if (kStatus_Success != MMC_SwitchToHS400(card))
                {
                    return kStatus_SDMMC_SwitchBusTimingFailed;
                }
                break;
            }

            card->busTiming = kMMC_HighSpeed200Timing;
        }

        if (card->busTiming == kMMC_HighSpeed200Timing)
        {
            if (((card->host->capability & (uint32_t)kSDMMCHOST_SupportHS200) != 0U) &&
                ((card->hostVoltageWindowVCCQ == kMMC_VoltageWindow170to195) ||
                 (card->hostVoltageWindowVCCQ == kMMC_VoltageWindow120)) &&
                (0U != (card->flags &
                        ((uint32_t)kMMC_SupportHS200200MHZ180VFlag | (uint32_t)kMMC_SupportHS200200MHZ120VFlag))))
            {
                if (kStatus_Success !=
                    MMC_SwitchToHS200(card, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, MMC_CLOCK_HS200)))
                {
                    return kStatus_SDMMC_SwitchBusTimingFailed;
                }
                break;
            }

            card->busTiming = kMMC_HighSpeedTiming;
        }

        if (card->busTiming == kMMC_HighSpeedTiming)
        {
            if (kStatus_Success != MMC_SwitchToHighSpeed(card))
            {
                return kStatus_SDMMC_SwitchBusTimingFailed;
            }
            break;
        }
    } while (false);

    return kStatus_Success;
}

static void MMC_DecodeCid(mmc_card_t *card, uint32_t *rawCid)
{
    assert(card != NULL);
    assert(rawCid != NULL);

    mmc_cid_t *cid;

    /*
     * The decoding of CID register is base on JEDEC Standard 84-B51 which can
     * support eMMC v5.0/5.1. JEDEC maintains the compatibility with older
     * versions like eMMC v4.1.
     */
    cid                 = &(card->cid);
    cid->manufacturerID = (uint8_t)((rawCid[3U] & 0xFF000000U) >> 24U);
    cid->applicationID = (uint16_t)((rawCid[3U] & 0xFF00U) >> 8U);

    cid->productName[0U] = (uint8_t)((rawCid[3U] & 0xFFU));
    cid->productName[1U] = (uint8_t)((rawCid[2U] & 0xFF000000U) >> 24U);
    cid->productName[2U] = (uint8_t)((rawCid[2U] & 0xFF0000U) >> 16U);
    cid->productName[3U] = (uint8_t)((rawCid[2U] & 0xFF00U) >> 8U);
    cid->productName[4U] = (uint8_t)((rawCid[2U] & 0xFFU));
    cid->productName[5U] = (uint8_t)((rawCid[1U] & 0xFF000000U) >> 24U);

    cid->productVersion = (uint8_t)((rawCid[1U] & 0xFF0000U) >> 16U);

    cid->productSerialNumber = (uint32_t)((rawCid[1U] & 0xFFFFU) << 16U);
    cid->productSerialNumber |= (uint32_t)((rawCid[0U] & 0xFFFF0000U) >> 16U);

    cid->manufacturerData = (uint8_t)((rawCid[0U] & 0xFF00U) >> 8U);
}

static status_t MMC_AllSendCid(mmc_card_t *card)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSDMMC_AllSendCid;
    command.argument     = 0U;
    command.responseType = kCARD_ResponseTypeR2;

    content.command = &command;
    content.data    = NULL;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if (kStatus_Success == error)
    {
        (void)memcpy(card->internalBuffer, (uint8_t *)command.response, 16U);
        MMC_DecodeCid(card, command.response);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_SendCsd(mmc_card_t *card)
{
    assert(card != NULL);

    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSDMMC_SendCsd;
    command.argument     = (card->relativeAddress << 16U);
    command.responseType = kCARD_ResponseTypeR2;

    content.command = &command;
    content.data    = NULL;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if (kStatus_Success == error)
    {
        (void)memcpy(card->internalBuffer, (uint8_t *)command.response, 16U);
        /* The response is from bit 127:8 in R2, corresponding to command.response[3][31:0] to
        command.response[0U][31:8]. */
        MMC_DecodeCsd(card, (uint32_t *)(uint32_t)card->internalBuffer);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_CheckBlockRange(mmc_card_t *card, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(blockCount != 0U);

