solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
    return status;
}

static status_t mmccard_init(mmc_card_t *card)
{
    assert(card != NULL);
    assert((card->hostVoltageWindowVCC != kMMC_VoltageWindowNone) &&
           (card->hostVoltageWindowVCC != kMMC_VoltageWindow120));
    assert(card->hostVoltageWindowVCCQ != kMMC_VoltageWindowNone);

    uint32_t opcode = 0U;
    status_t error  = kStatus_Success;

    if (!card->isHostReady)
    {
        return kStatus_SDMMC_HostNotReady;
    }
    /* set DATA bus width */
    SDMMCHOST_SetCardBusWidth(card->host, kSDMMC_BusWdith1Bit);
    /* Set clock to 400KHz. */
    card->busClock_Hz = SDMMCHOST_SetCardClock(card->host, SDMMC_CLOCK_400KHZ);

    error = MMC_GoIdle(card);
    /* Send CMD0 to reset the bus */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_GoIdleFailed;
    }

    /* Hand-shaking with card to validata the voltage range Host first sending its expected
       information.*/
    error = MMC_SendOperationCondition(card, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_HandShakeOperationConditionFailed;
    }

    error = MMC_ValidateOperationVoltage(card, &opcode);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_InvalidVoltage;
    }

    /* Get host's access mode. */
    opcode |= (card->host->maxBlockSize >= FSL_SDMMC_DEFAULT_BLOCK_SIZE ?
                   (uint32_t)kMMC_AccessModeSector << MMC_OCR_ACCESS_MODE_SHIFT :
                   (uint32_t)kMMC_AccessModeByte << MMC_OCR_ACCESS_MODE_SHIFT);

    error = MMC_SendOperationCondition(card, opcode);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_HandShakeOperationConditionFailed;
    }

    /* Get card CID */
    error = MMC_AllSendCid(card);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_AllSendCidFailed;
    }

    error = MMC_SetRelativeAddress(card);
    /* Set the card relative address */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SetRelativeAddressFailed;
    }

    error = MMC_SendCsd(card);
    /* Get the CSD register content */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SendCsdFailed;
    }

    /* Set to maximum speed in normal mode. */
    MMC_SetMaxFrequency(card);

    /* Send CMD7 with the card's relative address to place the card in transfer state. Puts current selected card in
    transfer state. */
    error = MMC_SelectCard(card, true);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SelectCardFailed;
    }

    /* Get Extended CSD register content. */
    error = MMC_SendExtendedCsd(card, NULL, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SendExtendedCsdFailed;
    }

    error = MMC_SetMaxEraseUnitSize(card);
    /* Set to max erase unit size */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_EnableHighCapacityEraseFailed;
    }

    error = MMC_SetBlockSize(card, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    /* set block size */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SetCardBlockSizeFailed;
    }

    error = MMC_SelectBusTiming(card);
    /* switch to host support speed mode, then switch MMC data bus width and select power class */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    error = MMC_SetPowerClass(card);
    /* switch power class */
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_SetPowerClassFail;
    }

    /* trying to enable the cache */
    (void)MMC_EnableCacheControl(card, true);

    /* Set card default to access non-boot partition */
    card->currentPartition = kMMC_AccessPartitionUserAera;

    return kStatus_Success;
}

status_t MMC_CardInit(mmc_card_t *card)
{
    assert(card != NULL);

    status_t error = kStatus_Success;
    /* create mutex lock */
    (void)SDMMC_OSAMutexCreate(&card->lock);
    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    error = mmccard_init(card);

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

void MMC_CardDeinit(mmc_card_t *card)
{
    assert(card != NULL);

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    (void)MMC_SelectCard(card, false);

    (void)SDMMC_OSAMutexDestroy(&card->lock);
}

status_t MMC_HostInit(mmc_card_t *card)
{
    assert(card != NULL);

    if (!card->isHostReady)
    {
        if (SDMMCHOST_Init(card->host) != kStatus_Success)
        {
            return kStatus_Fail;
        }
    }

    /* set the host status flag, after the card re-plug in, don't need init host again */
    card->isHostReady = true;

    return kStatus_Success;
}

void MMC_HostDeinit(mmc_card_t *card)
{
    assert(card != NULL);

    SDMMCHOST_Deinit(card->host);
    /* should re-init host */
    card->isHostReady = false;
}

void MMC_HostReset(SDMMCHOST_CONFIG *host)
{
    SDMMCHOST_Reset(host);
}

void MMC_HostDoReset(mmc_card_t *card)
{
    SDMMCHOST_Reset(card->host);
}

void MMC_SetCardPower(mmc_card_t *card, bool enable)
{
    SDMMCHOST_SetCardPower(card->host, enable);
    SDMMC_OSADelay(MMC_POWER_RESET_DELAY);
}

status_t MMC_Init(mmc_card_t *card)
{
    assert(card != NULL);

    status_t error = kStatus_Success;

    if (!card->isHostReady)
    {
        if (MMC_HostInit(card) != kStatus_Success)
        {
            error = kStatus_SDMMC_HostNotReady;
        }
    }
    else
    {
        /* reset the host */
        MMC_HostDoReset(card);
    }

    if (error == kStatus_Success)
    {
        /* reset card power */
        MMC_SetCardPower(card, false);
        MMC_SetCardPower(card, true);

        error = MMC_CardInit(card);
        if (error != kStatus_Success)
        {
            error = kStatus_SDMMC_CardInitFailed;
        }
    }

    return error;
}

void MMC_Deinit(mmc_card_t *card)
{
    assert(card != NULL);

    MMC_CardDeinit(card);
    MMC_HostDeinit(card);
}

bool MMC_CheckReadOnly(mmc_card_t *card)
{
    assert(card != NULL);

