solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
    return (((card->csd.flags & (uint16_t)kMMC_CsdPermanentWriteProtectFlag) != 0U) ||
            ((card->csd.flags & (uint16_t)kMMC_CsdTemporaryWriteProtectFlag) != 0U));
}

status_t MMC_SelectPartition(mmc_card_t *card, mmc_access_partition_t partitionNumber)
{
    assert(card != NULL);

    uint8_t bootConfig;
    mmc_extended_csd_config_t extendedCsdconfig;
    status_t error = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    bootConfig = card->extendedCsd.partitionConfig;
    bootConfig &= ~(uint8_t)MMC_PARTITION_CONFIG_PARTITION_ACCESS_MASK;
    bootConfig |= ((uint8_t)partitionNumber << MMC_PARTITION_CONFIG_PARTITION_ACCESS_SHIFT);

    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexPartitionConfig;
    extendedCsdconfig.ByteValue  = bootConfig;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success !=
        MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, (uint32_t)card->extendedCsd.partitionSwitchTimeout * 10U))
    {
        error = kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }
    else
    {
        /* Save current configuration. */
        card->extendedCsd.partitionConfig = bootConfig;
        card->currentPartition            = partitionNumber;
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t MMC_ReadBlocks(mmc_card_t *card, uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);

    uint32_t blockCountOneTime; /* The block count can be erased in one time sending READ_BLOCKS command. */
    uint32_t blockDone;         /* The blocks has been read. */
    uint32_t blockLeft;         /* Left blocks to be read. */
    uint8_t *nextBuffer;
    bool dataAddrAlign   = true;
    uint8_t *alignBuffer = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error       = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    blockLeft = blockCount;
    blockDone = 0U;
    error     = MMC_CheckBlockRange(card, startBlock, blockCount);
    if (kStatus_Success != error)
    {
        error = kStatus_InvalidArgument;
    }
    else
    {
        while (blockLeft != 0U)
        {
            nextBuffer = (uint8_t *)((uint32_t)buffer + blockDone * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            if (!card->noInteralAlign && (!dataAddrAlign || ((((uint32_t)nextBuffer) & (sizeof(uint32_t) - 1U)) != 0U)))
            {
                blockLeft--;
                blockCountOneTime = 1U;
                (void)memset(alignBuffer, 0, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
                dataAddrAlign = false;
            }
            else
            {
                if (blockLeft > card->host->maxBlockCount)
                {
                    blockLeft         = (blockLeft - card->host->maxBlockCount);
                    blockCountOneTime = card->host->maxBlockCount;
                }
                else
                {
                    blockCountOneTime = blockLeft;
                    blockLeft         = 0U;
                }
            }

            error = MMC_Read(card, dataAddrAlign ? nextBuffer : (uint8_t *)alignBuffer, (startBlock + blockDone),
                             FSL_SDMMC_DEFAULT_BLOCK_SIZE, blockCountOneTime);
            if (kStatus_Success != error)
            {
                error = kStatus_SDMMC_TransferFailed;
                break;
            }

            blockDone += blockCountOneTime;

            if (!card->noInteralAlign && (!dataAddrAlign))
            {
                (void)memcpy(nextBuffer, alignBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            }
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t MMC_WriteBlocks(mmc_card_t *card, const uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);

    uint32_t blockCountOneTime;
    uint32_t blockLeft;
    uint32_t blockDone;
    const uint8_t *nextBuffer;
    bool dataAddrAlign   = true;
    uint8_t *alignBuffer = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error       = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    blockLeft = blockCount;
    blockDone = 0U;

    error = MMC_CheckBlockRange(card, startBlock, blockCount);
    if (kStatus_Success != error)
    {
        error = kStatus_InvalidArgument;
    }
    else
    {
        while (blockLeft != 0U)
        {
            nextBuffer = (uint8_t *)((uint32_t)buffer + blockDone * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            if (!card->noInteralAlign && (!dataAddrAlign || (0U != (((uint32_t)nextBuffer) & (sizeof(uint32_t) - 1U)))))
            {
                blockLeft--;
                blockCountOneTime = 1U;
                (void)memcpy(alignBuffer, nextBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
                dataAddrAlign = false;
            }
            else
            {
                if (blockLeft > card->host->maxBlockCount)
                {
                    blockLeft         = (blockLeft - card->host->maxBlockCount);
                    blockCountOneTime = card->host->maxBlockCount;
                }
                else
                {
                    blockCountOneTime = blockLeft;
                    blockLeft         = 0U;
                }
            }
            error = MMC_Write(card, dataAddrAlign ? nextBuffer : (uint8_t *)alignBuffer, (startBlock + blockDone),
                              FSL_SDMMC_DEFAULT_BLOCK_SIZE, blockCountOneTime);
            if (kStatus_Success != error)
            {
                error = kStatus_SDMMC_TransferFailed;
                break;
            }

