solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/mmc/fsl_mmc.c
            blockDone += blockCountOneTime;
            if (!card->noInteralAlign && (!dataAddrAlign))
            {
                (void)memset(alignBuffer, 0, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            }
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t MMC_EnableCacheControl(mmc_card_t *card, bool enable)
{
    assert(card != NULL);

    uint8_t cacheCtrl = 0;

    mmc_extended_csd_config_t extendedCsdconfig;

    /* check the target driver strength support or not */
    if (card->extendedCsd.cacheSize == 0U)
    {
        SDMMC_LOG("The cache is not supported by the mmc device\r\n");
        return kStatus_SDMMC_NotSupportYet;
    }

    if (enable)
    {
        cacheCtrl = MMC_CACHE_CONTROL_ENABLE;
    }

    /* Switch to high speed timing. */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexCacheControl;
    extendedCsdconfig.ByteValue  = cacheCtrl;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
    {
        SDMMC_LOG("cache enabled failed\r\n");
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    card->extendedCsd.cacheCtrl = cacheCtrl;

    return kStatus_Success;
}

status_t MMC_FlushCache(mmc_card_t *card)
{
    assert(card != NULL);

    mmc_extended_csd_config_t extendedCsdconfig;
    status_t error = kStatus_Success;

    /* check the target driver strength support or not */
    if ((card->extendedCsd.cacheSize == 0U) || (card->extendedCsd.cacheCtrl != MMC_CACHE_CONTROL_ENABLE))
    {
        SDMMC_LOG("The cache is not supported or not enabled, please check\r\n");
        error = kStatus_SDMMC_NotSupportYet;
    }
    else
    {
        /* Switch to high speed timing. */
        extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
        extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexFlushCache;
        extendedCsdconfig.ByteValue  = MMC_CACHE_TRIGGER_FLUSH;
        extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
        if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
        {
            SDMMC_LOG("cache flush failed\r\n");
            error = kStatus_SDMMC_ConfigureExtendedCsdFailed;
        }
    }

    return error;
}

status_t MMC_SetSleepAwake(mmc_card_t *card, mmc_sleep_awake_t state)
{
    assert(card != NULL);
    status_t error = kStatus_Success;

    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};

    if (card->extendedCsd.extendecCsdVersion <=
        (uint32_t)kMMC_ExtendedCsdRevision13) /* V4.3 or above version card support boot mode */
    {
        return kStatus_SDMMC_NotSupportYet;
    }

    error = MMC_PollingCardStatusBusy(card, false, MMC_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    /* deselect the card before enter into sleep state */
    if (state == kMMC_Sleep)
    {
        if (MMC_SelectCard(card, false) != kStatus_Success)
        {
            return kStatus_SDMMC_DeselectCardFailed;
        }
    }

    command.index        = (uint32_t)kMMC_SleepAwake;
    command.argument     = ((uint32_t)state << 15U) | (card->relativeAddress << 16U);
    command.responseType = kCARD_ResponseTypeR1b;

    content.command = &command;
    content.data    = NULL;

    error = MMC_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    /* Sleep awake timeout value 100ns * 2^sleepAwakeTimeout */
    error = MMC_PollingCardStatusBusy(card, false, (1UL << card->extendedCsd.sleepAwakeTimeout) / 10000U);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    /* select the card after wake up */
    if (state == kMMC_Awake)
    {
        if (MMC_SelectCard(card, true) != kStatus_Success)
        {
            return kStatus_SDMMC_SelectCardFailed;
        }
    }

    return kStatus_Success;
}

static status_t MMC_Erase(mmc_card_t *card, uint32_t startGroupAddress, uint32_t endGroupAddress)
{
    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};
    status_t error               = kStatus_Success;

    /* Set the start erase group address */
    command.index              = (uint32_t)kMMC_EraseGroupStart;
    command.argument           = startGroupAddress;
    command.responseType       = kCARD_ResponseTypeR1;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    content.command = &command;
    content.data    = NULL;
    error           = MMC_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    /* Set the end erase group address */
    command.index    = (uint32_t)kMMC_EraseGroupEnd;
    command.argument = endGroupAddress;

    content.command = &command;
    content.data    = NULL;
    error           = MMC_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    /* Start the erase process */
    command.index              = (uint32_t)kSDMMC_Erase;
    command.argument           = 0U;
    command.responseType       = kCARD_ResponseTypeR1b;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    content.command = &command;
    content.data    = NULL;
    error           = MMC_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

status_t MMC_EraseGroups(mmc_card_t *card, uint32_t startGroup, uint32_t endGroup)
{
    assert(card != NULL);

    uint32_t startGroupAddress;
    uint32_t endGroupAddress;
    status_t error        = kStatus_Success;
    uint32_t eraseTimeout = MMC_CARD_ACCESS_WAIT_IDLE_TIMEOUT;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    error = MMC_CheckEraseGroupRange(card, startGroup, endGroup);
    if (kStatus_Success != error)
    {
        error = kStatus_InvalidArgument;
    }
    else
    {
        error = MMC_PollingCardStatusBusy(card, true, 0U);
        if (error != kStatus_SDMMC_CardStatusIdle)
        {
            error = kStatus_SDMMC_PollingCardIdleFailed;
        }
    }

    if (error == kStatus_SDMMC_CardStatusIdle)
    {
        /* Calculate the start group address and end group address */
        startGroupAddress = startGroup;
        endGroupAddress   = endGroup;
        if ((card->flags & (uint32_t)kMMC_SupportHighCapacityFlag) != 0U)
        {
            /* The implementation of a higher than 2GB of density of memory will not be backwards compatible with the
            lower densities.First of all the address argument for higher than 2GB of density of memory is changed to
            be sector address (512B sectors) instead of byte address */
            startGroupAddress = (startGroupAddress * (card->eraseGroupBlocks));
            endGroupAddress   = (endGroupAddress * (card->eraseGroupBlocks));
        }
        else
        {
            /* The address unit is byte when card capacity is lower than 2GB */
            startGroupAddress = (startGroupAddress * (card->eraseGroupBlocks) * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            endGroupAddress   = (endGroupAddress * (card->eraseGroupBlocks) * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
        }

        error = MMC_Erase(card, startGroupAddress, endGroupAddress);
        if (error == kStatus_Success)
        {
            if ((0U != (card->flags & (uint32_t)kMMC_SupportHighCapacityFlag)) &&
                (card->extendedCsd.highCapacityEraseTimeout != 0U))
            {
                eraseTimeout =
                    (uint32_t)card->extendedCsd.highCapacityEraseTimeout * 300U * (endGroup - startGroup + 1U);
            }

            error = MMC_PollingCardStatusBusy(card, true, eraseTimeout);
            if (kStatus_SDMMC_CardStatusIdle != error)
            {
                error = kStatus_SDMMC_PollingCardIdleFailed;
            }
            else
            {
                error = kStatus_Success;
            }
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t MMC_SetBootConfigWP(mmc_card_t *card, uint8_t wp)
{
    assert(card != NULL);

    mmc_extended_csd_config_t extendedCsdconfig;
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexBootConfigWP;
    extendedCsdconfig.ByteValue  = wp;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    card->extendedCsd.bootConfigProtect = wp;

    return kStatus_Success;
}

status_t MMC_SetBootPartitionWP(mmc_card_t *card, mmc_boot_partition_wp_t bootPartitionWP)
{
    assert(card != NULL);

    mmc_extended_csd_config_t extendedCsdconfig;
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexBootPartitionWP;
    extendedCsdconfig.ByteValue  = (uint8_t)bootPartitionWP;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    card->extendedCsd.bootPartitionWP = (uint8_t)bootPartitionWP;

    return kStatus_Success;
}

status_t MMC_SetBootConfig(mmc_card_t *card, const mmc_boot_config_t *config)
{
    assert(card != NULL);
    assert(config != NULL);

    uint8_t bootParameter;
    uint8_t bootBusWidth = (uint8_t)config->bootDataBusWidth;
    mmc_extended_csd_config_t extendedCsdconfig;

